[
  {
    "id": "daily-beer-can",
    "project": "Daily Beer Can",
    "cover_art": "/img/personal/all-thumbnail.webp",
    "description": "The Daily Beer Can project was a collaborative effort between myself and two friends, where we designed a unique beer can each day.<p></p>Each design featured a brand name, logo, beer name, and background, drawing inspiration from iconic pop culture movies.<p></p>Collaborating in Figma, we worked to daily deadlines, played to our strengths, and explored new design techniques.<p></p>Below are some of my favorite designs from this fun and rewarding project.",
    "role": "Designer & Illustrator (Collaborative)",
    "tools": "Illustrator, Photoshop & CorelDraw",
    "mockups": [
      "/img/personal/all-thumbnail.webp",
      "/img/personal/all-2.webp",
      "/img/personal/all-3.webp",
      "/img/personal/predator-1.webp",
      "/img/personal/predator-2.webp",
      "/img/personal/chucky.webp",
      "/img/personal/chucky-2.webp",
      "/img/personal/gremlins.webp",
      "/img/personal/gremlins-2.webp",
      "/img/personal/home-alone.webp",
      "/img/personal/home-alone-2.webp",
      "/img/personal/terminator-2.webp",
      "/img/personal/terminator-3.webp",
      "/img/personal/terminator-4.webp",
      "/img/personal/alien.webp",
      "/img/personal/bruce.webp",
      "/img/personal/bruce-2.webp",
      "/img/personal/goonies.webp",
      "/img/personal/goonies-2.webp",
      "/img/personal/cat.webp",
      "/img/personal/ash.webp",
      "/img/personal/superbad.webp",
      "/img/personal/fight-club-1.webp",
      "/img/personal/fight-club-2.webp",
      "/img/personal/american.webp",
      "/img/personal/bttf.webp",
      "/img/personal/bttf-2.webp",
      "/img/personal/scream.webp",
      "/img/personal/scream-2.webp",
      "/img/personal/black-phone.webp",
      "/img/personal/karate-kid.webp",
      "/img/personal/karate-kid-2.webp",
      "/img/personal/midsommar.webp",
      "/img/personal/dead.webp"
    ]
  },
  {
    "id": "kinetic",
    "project": "Kinetic",
    "cover_art": "/img/design/kinetic-thumbnail.webp",
    "description": "<strong>Client Flyer:</strong> Kinetic Recruitment sought to create a vibrant flyer for their employees to distribute to clients.<p></p>They aimed for a design that was engaging and energetic, departing from conventional, dull flyers.<p></p>After exploring several concepts, we collectively decided on two standout designs that struck the perfect balance between eye-catching visuals and a corporate aesthetic.",
    "about": "Freelance Graphic Design",
    "role": "Designer",
    "tools": "CorelDraw & Photoshop",
    "mockups": ["/img/design/kinetic-1.webp", "/img/design/kinetic-2.webp"],
    "description2": "<strong>Client Testimonial:</strong> At Kinetic, the emphasis is on fostering a friendly, hardworking team dedicated to helping people find employment.<p></p>They requested a playful yet easily readable design that would align with their existing brand colors.<p></p>To facilitate sharing on social media, we designed a square template that allows for easy updates.<p></p>We created multiple template variations to ensure a fresh and dynamic presentation without becoming repetitive.",
    "mockups2": [
      "/img/design/kinetic-mock.webp",
      "/img/design/kinetic-4.webp",
      "/img/design/kinetic-5.webp",
      "/img/design/kinetic-6.webp"
    ],
    "description3": "<strong>Pink Ribbon Breakfast:</strong> In support of Pink Ribbon Month, Kinetic Recruitment organized a delightful event where they distributed boxes of cupcakes to clients.<p></p>They envisioned a design that was not only fun and vibrant, reflecting the pink theme, but also communicated a powerful message about the impact of breast cancer on countless individuals in New Zealand.<p></p>The design effectively captured the essence of this important cause while maintaining an inviting and cheerful atmosphere.",
    "mockups3": [
      "/img/design/pink-ribbon.webp",
      "/img/design/kinetic-cup-cake.webp"
    ]
  },
  {
    "id": "wedding",
    "project": "Wedding",
    "cover_art": "/img/design/wedding-invite.webp",
    "description": "For our wedding, my partner and I collaborated on designing the invitation, welcome board, and QR code cards.<p></p>The invitation set the tone for our celebration, reflecting our personal style and the joy of the occasion.<p></p>The welcome board greeted guests upon arrival, simply directing them upstairs to the venue.<p></p>One of the highlights was the QR code cards, which I designed to encourage guests to capture and share their moments from the wedding.<p></p>The QR code allowed guests to easily upload their photos to a shared album, making it a fun and interactive way to collect memories from our special day.<p></p>This project was not only a labor of love but also a great way to showcase our creativity and teamwork as a couple.<p></p>I later built a custom website to display all those amazing memories in one place. The site features a responsive, masonry-style gallery that dynamically loads images via JSON, allowing us to showcase our guests' candid moments in a clean, engaging way. This was a great opportunity to bring together my love of design and web development into one meaningful project.",
    "role": "Designer",
    "tools": "CorelDraw,Photoshop, React, React Masonry CSS & JSON",
    "site_link": "https://wedding-five-sigma.vercel.app/",
    "mockups": [
      "/img/design/wedding-photo-card.webp",
      "/img/design/wedding-sign.webp",
      "/img/design/wed-board.webp",
      "/img/design/wedding-invite.webp",
      "/img/design/wed-invite.webp",
      "/img/design/pc-wed.webp",
      "/img/design/pc-wed-2.webp",
      "/img/design/lap-phone-wed.webp",
      "/img/design/wed-ipad-landscape.webp",
      "/img/design/wed-ipad-modal.webp",
      "/img/design/wed-ipad-portrait.webp",
      "/img/design/wed-modal-ipad.webp"
    ]
  },
  {
    "id": "brazen-designs",
    "project": "Brazen Designs",
    "cover_art": "/img/design/joe-1.webp",
    "description": "At Brazen Clothing, I have been working as a graphic designer for over 7 years, specializing in creating garment designs for screen printing and embroidery.<p></p>My role involves collaborating with clients via email and phone to transform their ideas into high-quality designs, working with spot colors, and meeting tight deadlines.<p></p>I also coordinate with screen printers and embroiderers to ensure every project is completed on time and to the highest standard.<p></p>This dynamic role allows me to balance creativity with technical precision, contributing to the success of custom apparel projects.<p></p>Below are a few of my favorite designs.",
    "about": "Freelance Graphic Design",
    "role": "Designer",
    "tools": "CorelDraw & Photoshop",
    "description2": "<strong>Wel Lift Crew:</strong> Wel Lift Crew is a gym/streetwear apparel company.<p></p>The client wanted that classic faded 90s style, inspired by old-school basketball and sports t-shirts.<p></p>They provided a few reference images to guide the design process.<p></p>This project was particularly enjoyable for me, as I have a deep appreciation for that design style.<p></p>It also provided a valuable opportunity to work across several different design programs.<p></p>Both the client and I were thrilled with the final result.",
    "mockups2": ["/img/design/joe-1.webp", "/img/design/joe-2.webp"],
    "description3": "<strong>Signal: </strong>Signal is a cyber security company that approached Brazen with a request for something 'nerdy' in design.<p></p>I’d call myself a nerd, but this was a different kind of nerdy.<p></p>The first design features a ball representing global security, with binary code spelling out 'Signal.'<p></p>The second design symbolizes their ability to secure cloud storage, with rain made of binary code illustrating their tagline, 'Taking on the World from NZ.'<p></p>Although the client initially wanted just one design, they were so pleased with both that they decided to print them both.",
    "mockups3": [
      "/img/design/signal-1.webp",
      "/img/design/signal-2.webp",
      "/img/design/signal-4.webp",
      "/img/design/signal-3.webp"
    ],
    "description4": "<strong>Aoraki: </strong>One day, the client came to me with a photo of a crane he had taken and asked if we could print it.<p></p>I took on the challenge of redrawing the photo into a printable vector file.<p></p>After five hours of work, this was the final result.<p></p>The design turned out so well that it became the standard print for Aoraki.",
    "mockups4": ["/img/design/aoraki-1.webp", "/img/design/aoraki-2.webp"],
    "description5": "<strong>Gipsy Kitchen: </strong>Gipsy Kitchen is a fantastic client to work with.<p></p>They have a signature Gipsy character, and every time they need a new design, they simply ask for 'Gipsy plus pop culture reference.'<p></p>This particular design was 'Gipsy plus Motorhead,' which was a lot of fun to create.<p></p>It was a great lesson in matching the tones of two distinct styles and merging them into one cohesive graphic.",
    "mockups5": ["/img/design/gipsy-2.webp", "/img/design/gipsy-3.webp"],
    "description6": "<strong>Mauri Construction: </strong>Mauri Construction came to me with a simple yet meaningful idea—starting a building company named after his Blue Heeler dog.<p></p>I chose a bold, straight-edge font to convey strength and solidity, which felt fitting for a building company.<p></p>We experimented with a few dog designs, and this one became our favorite: a dog with a hammer in its mouth, which perfectly captures the essence of a Kiwi builder.",
    "mockups6": ["/img/design/mauri-1.webp", "/img/design/mauri-2.webp"],
    "description7": "<strong>F45 Gym: </strong>F45 Gym is a regular client, as they host multiple competitions each year.<p></p>Typically, they send me a few ideas—such as animals and color schemes—and I take it from there, creating designs that align with their vision.<p></p>These are some of my favorite designs I've created for them, each one reflecting the energy and spirit of their competitions.",
    "mockups7": [
      "/img/design/f45-1.webp",
      "/img/design/f45-2.webp",
      "/img/design/f45-4.webp",
      "/img/design/f45-3.webp",
      "/img/design/f45-5.webp",
      "/img/design/f45-6.webp"
    ],
    "description8": "<strong>Fades & Sexy Babes: </strong>Crispy Fades & Sexy Babes came to Brazen looking for something different from the typical barber logo.<p></p>They provided a few reference images, and together we came up with a unique design that stood out from the crowd.<p></p>The client was extremely happy with the final result, and it perfectly captured their bold and distinctive brand identity.",
    "mockups8": ["/img/design/crispy-1.webp", "/img/design/crispy-2.webp"],
    "description9": "<strong>Little Sprig: </strong>Little Sprig Seatoun wanted to refresh their shirts with a new design, specifically focusing on the back of the shirt.<p></p>They asked if I could incorporate something that represented Seatoun.<p></p>We decided on the iconic little island just off Seatoun, as it's easily recognizable and makes for a striking design on the back of the shirt.",
    "mockups9": [
      "/img/design/lil-sprig-1.webp",
      "/img/design/lil-sprig-3.webp"
    ],
    "description10": "<strong>Manawa Tahi: </strong>Manawa Tahi, which translates to 'One Heart' in Māori, is a slow pitch team that wanted a design reflecting the sport, teamwork, and togetherness.<p></p>The brief was clear and straightforward, with few changes needed throughout the process.<p></p>The design came together seamlessly, and both the client and the team were thrilled with the final result, perfectly capturing the spirit of unity and camaraderie.",
    "mockups10": [
      "/img/design/manawa-tahi-1.webp",
      "/img/design/manawa-tahi-2.webp"
    ]
  },
  {
    "id": "tipu-garden-management-design",
    "project": "Tipu Garden Management",
    "cover_art": "/img/design/tipu-business-card-mock.webp",
    "description": "Tipu Garden Management is a gardening company founded by my brother-in-law, focused on providing professional and friendly gardening services.<p></p>The goal was to create a brand identity that stood out from the usual gardening aesthetics by incorporating earthy tones with a natural yet vibrant feel.<p></p>The project included designing a logo, business cards, and branded clothing such as hats and uniforms.<p></p>The final design successfully captured the essence of the brand, maintaining a professional look while staying approachable and fresh.<p></p>The logo translates beautifully into embroidery and screen printing, ensuring consistent and high-quality branding across all materials.",
    "about": "Freelance Graphic Design",
    "role": "Designer",
    "tools": "CorelDraw",
    "mockups": [
      "/img/design/tipu-card-mock.webp",
      "/img/design/tipu-logo.webp",
      "/img/design/tipu-hat.webp",
      "/img/design/tipu-tee.webp"
    ]
  },
  {
    "id": "one-off-bits",
    "project": "One Off Bits",
    "cover_art": "/img/personal/gdi2.webp",
    "description": "This collection features a variety of one-off pieces that don't have a dedicated category but still deserve a spotlight.<p></p>It's a blend of illustration and design, showcasing creativity, experimentation, and versatility.<p></p>Each piece brings something unique to the table, highlighting different styles and approaches that stand out on their own.",
    "role": "Designer & Illustrator",
    "tools": "Illustrator, Photoshop,CorelDraw & Procreate",
    "mockups": [
      "/img/personal/letters.webp",
      "/img/personal/no-slow.webp",
      "/img/personal/animals.webp",
      "/img/personal/book-club.webp",
      "/img/personal/face-punch.webp",
      "/img/personal/fwog.webp",
      "/img/personal/good-vibes-1.webp",
      "/img/personal/heyo.webp",
      "/img/personal/karate-guy.webp",
      "/img/personal/ski-guy.webp",
      "/img/personal/line-blend.webp",
      "/img/personal/lover-diggers.webp",
      "/img/personal/mlady.webp",
      "/img/personal/rotating-letters.webp",
      "/img/personal/sonic-knuckles.webp",
      "/img/personal/squishy.webp",
      "/img/personal/takeaway.webp",
      "/img/personal/tombi.webp",
      "/img/personal/trunks.webp",
      "/img/personal/wario.webp",
      "/img/personal/wolverine.webp",
      "/img/personal/bewk-club.webp"
    ]
  },
  {
    "id": "small-projects",
    "project": "Small Projects",
    "cover_art": "/img/design/finn-business-card.webp",
    "description": "A selection of small various projects that highlight different design needs and styles, including business cards and other one-off pieces.",
    "about": "Freelance Graphic Design",
    "role": "Designer",
    "tools": "CorelDraw",
    "mockups": [
      "/img/design/rachel-business-card.webp",
      "/img/design/finn-business-card.webp",
      "/img/design/nana-poster-mock-up.webp",
      "/img/design/nana-bingo-card-mock-up.webp",
      "/img/design/nana-bingo-2.webp"
    ]
  }
]
