[
  {
    "id": "kinetic",
    "project": "Kinetic",
    "cover_art": "/img/design/kinetic-thumbnail.webp",
    "description": "<strong>Client Flyer:</strong> Kinetic Recruitment sought to create a vibrant flyer for their employees to distribute to clients. They aimed for a design that was engaging and energetic, departing from conventional, dull flyers. After exploring several concepts, we collectively decided on two standout designs that struck the perfect balance between eye-catching visuals and a corporate aesthetic.",
    "about": "Freelance Graphic Design",
    "role": "Designer",
    "tools": "CorelDraw & Photoshop",
    "mockups": [
      "/img/design/kinetic-1.webp",
      "/img/design/kinetic-2.webp"
    ],
    "description2": "<strong>Client Testimonial:</strong> At Kinetic, the emphasis is on fostering a friendly, hardworking team dedicated to helping people find employment. They requested a playful yet easily readable design that would align with their existing brand colors. To facilitate sharing on social media, we designed a square template that allows for easy updates. We created multiple template variations to ensure a fresh and dynamic presentation without becoming repetitive.",
    "mockups2": [
      "/img/design/kinetic-mock.webp",
      "/img/design/kinetic-4.webp",
      "/img/design/kinetic-5.webp",
      "/img/design/kinetic-6.webp"
    ],
    "description3": "<strong>Pink Ribbon Breakfast:</strong> In support of Pink Ribbon Month, Kinetic Recruitment organized a delightful event where they distributed boxes of cupcakes to clients. They envisioned a design that was not only fun and vibrant, reflecting the pink theme, but also communicated a powerful message about the impact of breast cancer on countless individuals in New Zealand. The design effectively captured the essence of this important cause while maintaining an inviting and cheerful atmosphere.",
    "mockups3": [
      "/img/design/pink-ribbon.webp",
      "/img/design/kinetic-cup-cake.webp"
    ]
  },  
    {
        "id": "tipu-garden-management-design",
        "project": "Tipu Garden Management",
        "cover_art": "/img/design/tipu-business-card-mock.webp",
        "description": "Tipu Garden Management is a gardening company founded by my brother-in-law, focused on providing professional and friendly gardening services. The goal was to create a brand identity that stood out from the usual gardening aesthetics by incorporating earthy tones with a natural yet vibrant feel. The project included designing a logo, business cards, and branded clothing such as hats and uniforms. The final design successfully captured the essence of the brand, maintaining a professional look while staying approachable and fresh. The logo translates beautifully into embroidery and screen printing, ensuring consistent and high-quality branding across all materials",
        "about": "Freelance Graphic Design",
        "role": "Designer",
        "tools": "CorelDraw",
        "mockups": [
          "/img/design/tipu-card-mock.webp",
          "/img/design/tipu-logo.webp",
          "/img/design/tipu-hat.webp",
          "/img/design/tipu-tee.webp"
        ]
      },
      {
        "id": "brazen-designs",
        "project": "Brazen Designs",
        "cover_art": "/img/design/joe-1.webp",
        "description": "At Brazen Clothing, I have been working as a graphic designer for over 7 years, specializing in creating garment designs for screen printing and embroidery. My role involves collaborating with clients via email and phone to transform their ideas into high-quality designs, working with spot colors, and meeting tight deadlines. I also coordinate with screen printers and embroiderers to ensure every project is completed on time and to the highest standard. This dynamic role allows me to balance creativity with technical precision, contributing to the success of custom apparel projects. Below are a few of my favorite designs.",
        "about": "Freelance Graphic Design",
        "role": "Designer",
        "tools": "CorelDraw & Photoshop",
        "description2": "<strong>Wel Lift Crew:</strong> Wel Lift Crew is a gym/streetwear apparel company. The client wanted that classic faded 90s style, inspired by old-school basketball and sports t-shirts. They provided a few reference images to guide the design process. This project was particularly enjoyable for me, as I have a deep appreciation for that design style. It also provided a valuable opportunity to work across several different design programs. Both the client and I were thrilled with the final result.",
        "mockups2": [
          "/img/design/joe-1.webp",
          "/img/design/joe-2.webp"
        ],
        "description3": "<strong>Signal: </strong>Signal is a cyber security company that approached Brazen with a request for something 'nerdy' in design. I’d call myself a nerd, but this was a different kind of nerdy. The first design features a ball representing global security, with binary code spelling out 'Signal.' The second design symbolizes their ability to secure cloud storage, with rain made of binary code illustrating their tagline, 'Taking on the World from NZ.' Although the client initially wanted just one design, they were so pleased with both that they decided to print them both.",
        "mockups3": [
          "/img/design/signal-1.webp",
          "/img/design/signal-2.webp",
          "/img/design/signal-4.webp",
          "/img/design/signal-3.webp"
        ],
        "description4": "<strong>Aoraki: </strong>One day, the client came to me with a photo of a crane he had taken and asked if we could print it. I took on the challenge of redrawing the photo into a printable vector file. After five hours of work, this was the final result. The design turned out so well that it became the standard print for Aoraki.",
        "mockups4": [
          "/img/design/aoraki-1.webp",
          "/img/design/aoraki-2.webp"
        ],
        "description5": "<strong>Gipsy Kitchen: </strong>Gipsy Kitchen is a fantastic client to work with. They have a signature Gipsy character, and every time they need a new design, they simply ask for 'Gipsy plus pop culture reference.' This particular design was 'Gipsy plus Motorhead,' which was a lot of fun to create. It was a great lesson in matching the tones of two distinct styles and merging them into one cohesive graphic.",
        "mockups5": [
          "/img/design/gipsy-2.webp",
          "/img/design/gipsy-3.webp"
        ],
        "description6": "<strong>Mauri Construction: </strong>Mauri Construction came to me with a simple yet meaningful idea—starting a building company named after his Blue Heeler dog. I chose a bold, straight-edge font to convey strength and solidity, which felt fitting for a building company. We experimented with a few dog designs, and this one became our favorite: a dog with a hammer in its mouth, which perfectly captures the essence of a Kiwi builder.",
        "mockups6": [
          "/img/design/mauri-1.webp",
          "/img/design/mauri-2.webp"
        ],
        "description7": "<strong>F45 Gym: </strong>F45 Gym is a regular client, as they host multiple competitions each year. Typically, they send me a few ideas—such as animals and color schemes—and I take it from there, creating designs that align with their vision. These are some of my favorite designs I've created for them, each one reflecting the energy and spirit of their competitions.",
        "mockups7": [
          "/img/design/f45-1.webp",
          "/img/design/f45-2.webp",
          "/img/design/f45-4.webp",
          "/img/design/f45-3.webp",
          "/img/design/f45-5.webp",
          "/img/design/f45-6.webp"
        ],
        "description8": "<strong>Fades & Sexy Babes: </strong>Crispy Fades & Sexy Babes came to Brazen looking for something different from the typical barber logo. They provided a few reference images, and together we came up with a unique design that stood out from the crowd. The client was extremely happy with the final result, and it perfectly captured their bold and distinctive brand identity.",
        "mockups8": [
          "/img/design/crispy-1.webp",
          "/img/design/crispy-2.webp"
        ],
        "description9": "<strong>Little Sprig: </strong>Little Sprig Seatoun wanted to refresh their shirts with a new design, specifically focusing on the back of the shirt. They asked if I could incorporate something that represented Seatoun. We decided on the iconic little island just off Seatoun, as it's easily recognizable and makes for a striking design on the back of the shirt.",
        "mockups9": [
          "/img/design/lil-sprig-1.webp",
          "/img/design/lil-sprig-3.webp"
        ],
        "description10": "<strong>Manawa Tahi: </strong>Manawa Tahi, which translates to 'One Heart' in Māori, is a slow pitch team that wanted a design reflecting the sport, teamwork, and togetherness. The brief was clear and straightforward, with few changes needed throughout the process. The design came together seamlessly, and both the client and the team were thrilled with the final result, perfectly capturing the spirit of unity and camaraderie.",
        "mockups10": [
          "/img/design/manawa-tahi-1.webp",
          "/img/design/manawa-tahi-2.webp"
        ]
      }
  ]
  