[
  {
    "id": "tipu-garden-management",
    "project": "Tipu Garden",
    "cover_art": "/img/web/iphone-ipad-pc-tipu.webp",
      "description": "This project is a responsive gardening company website for Tipu Garden Management, designed to showcase their services, past projects, and customer reviews.<p></p>The frontend was built using React with a custom design, while the backend is powered by WordPress for content management.<p></p>The site incorporates custom templates created with PHP, enabling dynamic and tailored content presentation.<p></p>Key functionalities include SEO optimization using Yoast SEO, e-commerce integration with WooCommerce, and custom forms for user inquiries through Contact Form 7.<p></p>Secure Custom Fields and ACF to REST API were implemented for advanced data handling, while All-in-One Migration facilitated seamless deployment.",
    "about": "Yoobee WEB UI/UX 2024",
    "role": "Full-Stack Developer",
    "tools": "React, WordPress, PHP, Vite, Yoast SEO, WooCommerce, Contact Form 7, CPT UI, Secure Custom Fields, ACF to REST API, All-in-One Migration",
    "site_link": "https://tipu-garden-management.vercel.app/#/",
    "git_repo": "https://github.com/BaxterMcKenzie/tipu-garden-management",
    "git_repo2": "https://github.com/BaxterMcKenzie/tipu-custom-theme",
    "mockups": [
      "/img/web/floating-pc-tipu.webp",
      "/img/web/floating-laptop-tipu.webp",
      "/img/web/tablet-tipu.webp",
      "/img/web/3-phones-tipu.webp"
    ]
  },
  {
    "id": "my-favourite-albums",
    "project": "My Favourite Albums",
    "cover_art": "/img/web/my_favourite_albums.webp",
    "description": "This project showcases a collection of my favorite albums and artists using a responsive grid-based design.<p></p>The album data is dynamically loaded from a JSON file, allowing for easy updates and scalability.<p></p>Users can explore key album details, such as artist names, release years, genres, and album art, presented in an interactive card layout.<p></p>One of the project's key features is the use of Axios to fetch data from the local JSON file, ensuring the content is dynamic without requiring a full backend.<p></p>The cards are styled using CSS Grid for responsive layouts, and subtle hover animations bring the design to life.<p></p>This project highlights my skills in front-end development, working with external data, and responsive design.",
    "about": "Yoobee WEB UI/UX 2024",
    "role": "Developer and Designer",
    "tools": "React, Axios, CSS Grid",
    "site_link": "https://my-favourite-albums.vercel.app/",
    "git_repo": "https://github.com/BaxterMcKenzie/my-favourite-albums",
    "mockups": [
      "/img/web/album-desktop.webp",
      "/img/web/album-tablet.webp",
      "/img/web/album-phone.webp"
    ]
  },
  {
    "id": "pokemon-app",
    "project": "Pokemon App",
    "cover_art": "/img/web/pokemon-thumbnail.webp",
    "description": "This project is a Pokémon viewer built with React, where users can explore Pokémon stats, abilities, and moves.<p></p>It uses React Router for navigation and Axios to fetch data.<p></p>Each Pokémon card shows official artwork, animated sprites, and key stats like HP and attack.<p></p>Custom CSS with type-based color schemes and GSAP-powered Pokéball animations create an engaging user experience.<p></p>Sound integration adds immersive Pokémon cries, and the layout is responsive across devices using CSS modules.<p></p>This project showcases my skills in front-end development, interactive design, and working with APIs.",
    "about": "Yoobee WEB UI/UX 2024",
    "role": "Developer and Designer",
    "tools": "React, React Router, Axios, GSAP, CSS Modules",
    "site_link": "https://pokedex-psi-ochre.vercel.app/",
    "git_repo": "https://github.com/BaxterMcKenzie/Pokedex",
    "mockups": [
      "/img/web/pokemon-phone.webp",
      "/img/web/pokemon-laptop.webp",
      "/img/web/pokemon-tablet.webp",
      "/img/web/pokemon-phone2.webp"
    ]
  },
  {
    "id": "dicks-decks",
    "project": "Dick's Decks",
    "cover_art": "/img/web/dicks_decks.webp",
    "description": "This project showcases a dynamic skateboard store with sorting, filtering, and mapping features using a responsive design.<p></p>Deck data is dynamically loaded, allowing users to explore key product details such as brand, width, and price, presented in an interactive card layout.<p></p>A key feature is the use of jQuery to handle user interactions and Swiper.js for smooth image carousels.<p></p>Mapbox integration provides a visual way to explore store locations on a map.<p></p>The cards are styled using CSS Grid for responsive layouts, with hover effects to enhance the user experience.<p></p>This project demonstrates my skills in front-end development, working with JSON data, and building interactive, data-driven interfaces.",
    "about": "Yoobee WEB UI/UX 2024",
    "role": "Developer and Designer",
    "tools": "HTML, CSS, JavaScript, jQuery, Swiper.js, Mapbox, Axios, Illustrator",
    "site_link": "https://skateshop-cyan.vercel.app/",
    "git_repo": "https://github.com/BaxterMcKenzie/skateshop",
    "mockups": [
      "/img/web/dicks-decks-multi.webp",
      "/img/web/dicks-decks-tablet.webp",
      "/img/web/dicks-decks-phone.webp",
      "/img/web/dicks-decks-laptop.webp"
    ]
  },
  {
    "id": "artie-fartie",
    "project": "Artie Fartie",
    "cover_art": "/img/web/artie-fartie-phone.webp",
    "description": "This project showcases a collaborative craft marketplace built with React, featuring a responsive front-end and secure back-end integration.<p></p>The site allows users to browse, filter, and purchase handcrafted items while supporting multiple user roles such as buyers, sellers, and admins.<p></p>Key functionalities include smooth navigation with React Router, data handling with Axios, and optimized state management.<p></p>The back-end, built with Express and MongoDB, manages authentication, secure file uploads via Cloudinary, and data validation to ensure reliability.<p></p>The interface is styled using Sass, with responsive layouts powered by Vite.",
    "about": "Yoobee WEB UI/UX 2024",
    "role": "Front-end, Back-end Developer and Collaborator",
    "tools": "React, React Router, Sass, Vite, Axios, Express, MongoDB, Mongoose, Cloudinary, JWT, Photoshop. Coordinated tasks using Trello, collaborated on design prototypes in Figma, and managed version control with GitHub.",
    "site_link": "https://artie-fartie-frontend.vercel.app/",
    "git_repo": "https://github.com/BaxterMcKenzie/artie-fartie",
    "mockups": [
      "/img/web/artie-fartie-iphone-ipad-pc.webp",
      "/img/web/artie-fartie-phone.webp",
      "/img/web/artie-fartie-thumbnail.webp",
      "/img/web/artie-fartie-duel-phone.webp",
      "/img/web/artie-fartie-ipad.webp",
      "/img/web/artie-fartie-pc.webp"
    ]
  },
  {
    "id": "north-island-stays",
    "project": "North Island Stays",
    "cover_art": "/img/web/north-island-stays-desktop-mobile.webp",
    "description": "This project is an accommodation booking platform that provides users with a seamless way to find, filter, and book properties across multiple locations.<p></p>The site integrates a dynamic search feature, real-time map visualization using Mapbox, and interactive forms with input validation.<p></p>Users can filter properties based on location, type, guest capacity, and other amenities, while sort functions help with price comparisons.<p></p>Fullpage.js powers smooth navigation across different sections, enhancing the overall user experience.",
    "about": "Yoobee WEB UI/UX 2024",
    "role": "Full-Stack Developer",
    "tools": "JavaScript, jQuery, Mapbox, Fullpage.js, Gulp, Sass, GitHub",
    "site_link": "https://housing-app-beryl.vercel.app/",
    "git_repo": "https://github.com/BaxterMcKenzie/Housing-App",
    "mockups": [
      "/img/web/north-island-stays-multi-phone.webp",
      "/img/web/north-island-stays-laptop.webp",
      "/img/web/north-island-stays-desktop-multi.webp",
      "/img/web/north-island-stays-tablet-vert.webp"
    ]
  }
]
